final_project/cases_lift/base_case_angle5_5/0/nuTilda
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      nuTilda;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

internalField   uniform 1e-5;

boundaryField
{
    //- Set patchGroups for constraint patches
    #include "${WM_PROJECT_DIR}/etc/caseDicts/setConstraintTypes"

    inlet
    {
      type            fixedValue;
      value	uniform 3.432e-5;
    }

    outlet
    {
      type            zeroGradient;
      
    }

    wing
    {
      type            fixedValue;
      value           uniform 0;
    }
    sym1
    {
      type            zeroGradient;
    
    }

    sym2
    {
      type            zeroGradient;
     
    }

    top
    {
      type            zeroGradient;
      
    }

    bottom
    {
      type            zeroGradient;
      
    }
}

// ************************************************************************* //
